---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableFilletSpecifiedRadius
source: html/c1a4943a-b84e-5b84-3cb5-cd7c5402bc48.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableFilletSpecifiedRadius Property

Unable to create Fillet with the specified radius.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableFilletSpecifiedRadius { get; }
```